#### ImageTypeSource Enumeration

---

|  |
| --- |
| See Also |

The source of the data used to generate the image.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public enum ImageTypeSource ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ImageTypeSource ``` |

| Visual C++ |
| --- |
| ``` public enum class ImageTypeSource ``` |

# Members

| Member name | Description |
| --- | --- |
| Link | The image data is from an externally linked image file. |
| Import | The image data was imported into the Revit document. |
| Internal | The image data was created internally. These are rendering images or views saved in the project as images. |

# See Also

Autodesk.Revit.DB Namespace